<style>
	table, th, td {
		border: 1px solid black;
	}
</style>

<?php
// Преобразование строк в число происходит следующим образом: если строка начинается с символа, недопустимого для чисел, то она преобразуется в ноль.
// В противном случае - преобразование будет происходить до первого встреченного нецифрового символа. Таким образом:
$ex1 = "12abc" + 1; // 12 + 1 = 13
$ex2 = "-12abc" + 3; // -12 + 3 = -9
$ex3 = "-12.1" + 3; // -12.1 + 3 = -9.1
$ex4 = "-12.1abc" + 3; // -12.1 + 3 = -9.1

echo 'а) "12abc" + 1 = ', $ex1, "<br>",
	'б) "-12abc" + 3 = ', $ex2, "<br>",
	'в) "-12.1" + 3 = ', $ex3, "<br>",
	'г) "-12.1abc" + 3 = ', $ex4, "<br>";
	
$table = <<<HERE_NAME
	<table>
		<tr>
			<th> Выражение </th>
			<th> Результат </th>
		</tr>
		<tr>
			<td> "12abc" + 1 </td>
			<td> $ex1 </td>
		</tr>
		<tr>
			<td> "-12abc" + 3 </td>
			<td> $ex2 </td>
		</tr>
		<tr>
			<td> "-12.1" + 3 </td>
			<td> $ex3 </td>
		</tr>
		<tr>
			<td> "-12.1abc" + 3 </td>
			<td> $ex4 </td>
		</tr>
	</table>
HERE_NAME;
echo $table;
?>